# 인접 행렬 표현
vtx = ['A','B','C','D']
adjMat = [[1,0,1,0],
       [1,0,0,0],
       [0,0,0,1],
       [1,0,1,0]]

# 인접 정점 리스트 표현
vtx = ['A','B','C','D']
adjList = [[0,2],
           [0],
           [3],
           [0,2]]

vtx = ['A','B','C','D']
adjList = [['C'],
           ['A'],
           ['D'],
           ['A','C']]

# 하나의 객체로 표현
graph = [('A'),['A','C'],
         ('B'),['A'],
         ('C'),['D'],
         ('D'),['A','C']]

# 딕셔너리로 표현
graph = { 'A':['A','C'],
         'B':['A'],
         'C':['D'],
         'D':['A','C']}

# 딕셔너리와 집합으로 표현
graph - {'A': {'A','C'},
         'B': {'A'},
         'C': {'D'},
         'D': {'A','C'}}